{"ADONIS": "", "AFFAIR": "", "AHEGAO": "A style of exaggerated facial expression often used in Japanese manga\n anime\n and hentai\n featuring such characteristics as crossed eyes\n protruding tongue\n and flushed cheeks to indicate sexual arousal or ecstasy. “I made an ahegao face when I found out Fall Guys was going free-to-play.”", "AHEGOA": "", "AHOLE": "A shortened version of the word asshole. “Anyone who doesn’t properly use their turn signals is an ahole” ", "ANALLY": "The adverb of Anal\n likely referring to the sexual act. “I was anally screwed by the tax man this year.”", "ANALS": "", "ANUSES": "", "AREOLA": "", "AROUSE": "To evoke or awaken sexual excitement. “If you really want to arouse me\n spank my ass and call me a dirty bitch. Or just make me a tray of cinnamon rolls\n I’m good with either.”", "ARSED": "", "ARSES": "", "ASSED": "", "ASSES": "More than one ass. “I kinda feel like they oversold the new Fillmore Butts video\n the description promised ‘a veritable cornucopia of tight asses’ but I don’t know if five asses really constitutes a cornucopia. I nevertheless busted multiple nuts to it and therefore give it three stars out of five.”", "ASSHAT": "Typically a person with whom is such a fool you wish you could re-arrange their body so they would be wearing their ass as a hat.", "ASSJOB": "The act of using one’s lubed-up ass cheeks to stimulate a penis by grinding on it\n without actual anal penetration. “Hey\n I’m exhausted and not really in the mood for our usual Tuesday night anal reaming session so how about I just give you a nice assjob\n you can jizz all over my back and we’ll get an early night? Oh shit sorry dad\n that text was meant for someone else.”", "ASSMAN": "A man who has a particular predilection for asses. “Assman\n Jerry! I’m Cosmo Kramer\n the Assman!” ", "ASSWIT": "", "BADASS": "", "BAKED": "", "BALLS": "Testicles. “I shaved my balls and now they look like two Kinder eggs\n I kind of dig it.”", "BANGED": "Past participle of bang - to have sex\n particularly in energetic fashion. \"We banged all night\n in fact I\\'m so exhausted I can\\'t think of a funny joke.\"", "BANGER": "", "BANGS": "", "BARFED": "", "BARSE": "A compound word of balls and arse. “Did you hear that Ryan put honey all over his barse and was promptly attacked by a badger?”", "BATES": "", "BATTY": "", "BAWBAG": "", "BAWDY": "", "BEADED": "", "BEADS": "", "BEARS": "", "BEATS": "", "BEAVER": "A vagina. “I’m a taxidermist who moonlights as a gigolo\n so I’m stuffing beavers all day and stuffing beavers all night.”", "BEHIND": "", "BEHMO": "", "BELCH": "", "BEMHO": "Acronym - Basic Early Morning Hard On. Otherwise known as morning wood\n a penis that is erect upon waking without need for stimulation or indeed explanation. “I woke up with a BEMHO this morning so I decided to rub one out before hopping in the shower.”", "BENIS": "", "BENWA": "Small orbs that are intended to be inserted into the vagina or rectum. Given their hefty weight they will bounce against each other within and cause vibrations internally.", "BEOTCH": "", "BEWBS": "Alternative slang spelling of boobs. “LOL bewbs.”", "BEZOS": "A villain that doesn’t care about anything other than themselves. Usually the most despicable person you have ever heard of. “I saw that guy literally steal candy from a baby\n what an absolute bezos”", "BIMBO": "", "BIMBOS": "", "BITCH": "", "BITCHY": "", "BITES": "", "BITING": "", "BLAZED": "", "BLOODY": "", "BLOWED": "", "BLOWIE": "Slang for blowjob. “What’s the strongest over-the-counter painkiller you have? I threw out my back trying to give myself a blowie.”", "BLOWN": "", "BLOWS": "", "BLOWY": "", "BOABY": "", "BOINK": "Relatively harmless euphemism for sex\n suitable for use around uptight family members\n Fox News viewers\n etc. “Sorry grandma\n I can’t talk right now\n I’m boinking. Can I call you back later?”", "BOINKS": "", "BOLLIX": "", "BOLLOX": "", "BONCH": "Slang term for the perineum\n the area between the anus and genitalia. “I had an itchy bonch during the team meeting but I couldn’t scratch it without drawing attention to myself so I just had to ride it out.”", "BONDS": "", "BONED": "Past participle of bone\n aka fuck/screw/copulate etc. Like fucked\n has a popular alternate non-sexual usage to describe a person or situation in deep trouble. “Well how can they be jamming us if they don’t know… if we’re coming? Break off the attack! The shield is still up! We are totally boned!” Lando Calrissian\n Return of the Jedi\n 1983", "BONER": "Slang for an erect penis. “I get a boner every time I win a crown in Fall Guys\n is that weird?”", "BONERS": "Plural of boner\n which incidentally was Lewdle’s first ever word! “I’ve had some inopportune boners in my time\n but the one I got while delivering the eulogy at gram-gram’s funeral really takes the biscuit. To be fair\n it was a pretty hot eulogy.”", "BONES": "", "BONING": "", "BONKED": "Past participle of bonk\n to engage in sexual intercourse. “My boyfriend and I bonked all night and then overslept so we missed the Nintendo Direct\n did they announce any new Pokemon stuff?”", "BONKS": "", "BOOBA": "A commonly used term in online communities of incel losers that are incapable of speaking to or respecting women.", "BOOBIE": "", "BOOBS": "Breasts. “I like boobs.” – literally everyone", "BOOBY": "", "BOOFED": "Past participle of boof\n to participate in anal sex. “My husband told me he wanted to try something new in the bedroom\n so I boofed him with his own fleshlight. That should keep him quiet for a while.”", "BOOFER": "", "BOOFS": "", "BOOGER": "", "BOOTIE": "", "BOOTY": "A butt\n particularly one of the large and delicious variety. “Shake shake shake\n shake shake shake\n shake your booty.” – KC & the Sunshine Band\n 1976.", "BORIS": "", "BOSOM": "", "BOSSER": "", "BOSSY": "", "BOTTOM": "", "BOUNCE": "", "BOUND": "", "BOXERS": "", "BOYTOY": "A young man who is used by a typically older partner for casual\n no-strings sex. “Now that my divorce is final I’m gonna find myself a nice little boytoy to eat out my asshole whenever I feel like it.” ", "BOZOS": "", "BRAIN": "Another term for blowjob. Thought to derive from the fact that most men’s brains are present within their penis exclusively.", "BRAPS": "", "BRATS": "", "BRATTY": "", "BREAST": "", "BREED": "The act of having someone ejaculate inside of you without a condom or protection of any kind because you want them so badly you’ll have their children. “I sometimes lay in my hammock and daydream about having Michael Fassbender breed me.”", "BREEDS": "", "BRIEFS": "", "BROAD": "", "BROJOB": "A blowjob between two male friends\n or bros\n in which one bro fellates the other bro purely to help him out due to a case of blue balls\n boredom\n etc. “Dude\n I haven’t been able to bust a nut since I sprained my wrist playing beer pong last week\n would you mind giving me a brojob to help me out?”", "BRONY": "", "BROWSE": "", "BRUISE": "", "BUGGER": "(Chiefly British) A person who penetrates the anus of someone during sexual intercourse\n or the act of doing so. “Sweetheart\n I’ve had a hell of a day and need some stress relief so I’d really like you to bend me over the couch and bugger me senseless.” ", "BUKAKE": "", "BULGE": "The male genitalia\n particularly when large and/or engorged\n as visible through clothing. “The guy sitting opposite me on the subway today was a manspreader\n and his bulge was on full display. I’m going back to working from home.”", "BULGES": "", "BULLS": "", "BUMBUM": "", "BUMMED": "", "BUMMER": "", "BUMMY": "", "BUMSEX": "", "BUNDA": "An ass that is both gigantic and round. “You see the incredible bunda on that lass? You could host a fucking wrestling match on that ring.”", "BUSHY": "", "BUSSY": "“Boy pussy”\n aka a man’s asshole. “My new boyfriend has a very nice bussy\n all pink and fragrant\n it reminds me of a budding rose. That I can stick my penis in.”", "BUSTED": "", "BUSTS": "", "BUSTY": "", "BUTCH": "", "BUTTOX": "", "BUTTS": "Plural of butt. “I like big butts and I cannot lie\n you other brothers can’t deny that when a girl walks in with an itty bitty waist and a round thing in your face you get sprung.” President Gerald R. Ford inaugural address\n August 9\n 1974", "BUXOM": "", "CAGED": "", "CAGER": "", "CAGES": "", "CAGING": "The act of confining genitalia within a tight cage. Typically used within a BDSM act to ensure celibacy until otherwise allowed by another.", "CAKES": "", "CAMBOY": "", "CAMGAL": "", "CANING": "To hit\n whip\n or spank someone with a cane with the intention of inflicting both pain and pleasure.", "CARNAL": "", "CARPET": "", "CARSE": "", "CERVIX": "", "CHAIN": "", "CHAPS": "", "CHASER": "", "CHEAT": "", "CHEATS": "", "CHEBB": "", "CHEEK": "", "CHEEKS": "", "CHEESE": "", "CHERRY": "", "CHEST": "", "CHESTY": "", "CHOAD": "", "CHOADS": "", "CHOAT": "", "CHODA": "", "CHODE": "A short\n fat\n stubby penis. Alternatively\n the area between the genitalia and the anus. Alternatively\n a socially maladroit or stupid individual. “I like Brian but he’s a bit of a chode\n also I heard he has a chode\n and that his chode smells.”", "CHODES": "", "CHOKE": "", "CHOKED": "", "CHOKER": "A tight necklace typically worn to symbolize submission and ownership in the BDSM community. Now chokers have become more of a fashion piece worn casually.", "CHOKES": "", "CHONES": "Underwear. “All of my chones have pretty serious skid marks so I’m going commando today.”", "CHUBBY": "A semi-erect penis. “My mother-in-law just came to visit and when she hugged me it kinda gave me a chubby\n what do you think that means? Should I be concerned? Yes I know this is a Wendy’s drive-through. What\n you can’t have an opinion?”", "CHUFF": "", "CIALIS": "", "CLACK": "", "CLAMP": "", "CLAMPS": "", "CLAMS": "", "CLIMAX": "Synonym for orgasm. “I was just about to climax when one of the actors in the Pornhub video I was watching started doing a sponsored ad read for Raid Shadow Legends right in the middle of a reverse cowgirl. Is nothing sacred any more?”", "CLITS": "Plural of clit\n short for clitoris. “Yeah\n Brad likes to think of himself as a ladies’ man\n but I happen to know that you can count the number of clits he has successfully located in his lifetime on the fingers of Captain Hook’s left hand.”", "CLITTY": "", "CLOACA": "", "CLUNG": "", "CLUNGE": "British slang for vagina. “Last night I found out my new boyfriend DVRs Tucker Carlson’s show every night. I told him that if he wants to watch that total fucking clunge he can forget about going anywhere near mine.”", "CLUNT": "", "COCKER": "", "COCKS": "Plural of cock. “I love cocks! The bigger the better. As many as possible\n in as many of my holes as possible. In my pussy\n in my mouth\n in my ass\n I just can’t get enough!” – Your mom.", "COITUS": "", "COLLAR": "", "COLON": "", "COMES": "", "CONCH": "", "CONDOM": "", "COOCH": "Slang for vagina. “I tried waxing my own cooch and it didn’t go well\n now it looks like the back of my dad’s head when he started to go bald.”", "COOLEY": "", "COOMER": "An oversexed young man and/or excessive masturbator. “I like to watch Hasan but I am constantly distracted by the sheer quantity of coomers present in his stream”", "COOTER": "", "COOZE": "Slang for vagina. “The new XXL dildo I ordered finally arrived so I’ll be giving my cooze a good workout tonight.” ", "CORSET": "", "COUGAR": "An older woman with a ferocious sexual appetite for younger men. “I’m a little tired today\n I hooked up with this total cougar at the club last night\n she took me back to her place and tossed my salad.”", "CRABS": "Informal term for pubic lice\n small parasites that attach to the hair and skin near the genitals\n typically transmitted via sexual contact. “I’ve been itching down there ever since I hooked up with Daryl and now I’m starting to think he might have given me crabs\n that dirty fuck.”", "CRACK": "", "CRACKS": "", "CRANK": "A penis. “My D&D group canceled on me tonight so I’m just gonna stay home with my prize-winning collection of Mia Malkova videos and yank my crank. Talk about rolling for initiative!”", "CRAPPY": "", "CRAPS": "", "CRASS": "", "CREAM": "", "CREAMS": "", "CREAMY": "", "CROTCH": "", "CRUSTY": "", "CUCKED": "Short for cuckolded — the state of having been sidelined by one’s romantic partner in favor of one who possesses greater sexual prowess. As a kink\n the submissive partner\n or cuckold\n derives gratification by passively observing the sex taking place in front of them. “My night? Yeah it was pretty good\n I got cucked. Sat on the sofa and watched while some bronzed stallion we met at the YMCA pounded my wife’s pussy into oblivion. What\n too much info?”", "CUCKER": "", "CUCKS": "", "CUFFS": "", "CUMBAG": "", "CUMBY": "", "CUMING": "", "CUMJAR": "A jar that someone has come inside of a non-zero amount of times. “Did Alan show you his cumjar? I can’t believe a whole sentient society has grown inside of it over the last four years.”", "CUMMED": "", "CUMMY": "", "CUMPIE": "", "CUMPT": "Informal past tense of cum. “I cumpt when I saw Ryan Gosling as Ken in the Barbie movie.”", "CUMRAG": "Any item that can be used to ejaculate into or clean up ejaculate after the fact\n such as a paper towel\n washcloth\n etc. “Stuck without a cumrag to mop up your jizz because you didn’t plan ahead before rubbing one out? An athletic sock can do the job in a pinch.” — Good Housekeeping magazine\n March 1957", "CUMSY": "", "CUMWAD": "A load of semen\n or alternatively a wad of toilet paper that has been ejaculated into and crumpled up. “I just accidentally blew my nose on a cumwad\n I guess that’ll teach me to leave them lying around the bedroom.”", "CUNNY": "", "CUNTED": "", "CUNTS": "Plural of \"cunt\"\n particularly potent slang for vagina. \"That porno we watched last night was insane\n my mom said she’d never seen so many dripping wet cunts in one place.\"", "CUNTY": "", "CURVY": "", "CUSSY": "A term popular among a very specific subset of fans of Disney/Pixar’s Cars series of films\n who posit that since there are male and female cars in that universe\n they must have reproductive organs. Cussy = car pussy. “You’d better be sure and win that big race McQueen\n or you’re never getting a whiff of this cussy again!” - Sally Carrera\n Cars 4 (hopefully) (or not)", "DADDY": "An attractive older man\n or one who assumes a dominant role during sexual role-play. “Spank me harder\n daddy\n I’ve been a very bad little girl!”", "DAMMIT": "", "DAMNED": "", "DAMNIT": "", "DAMNS": "", "DANGLE": "", "DANGLY": "", "DANKER": "", "DATASS": "", "DEEPER": "", "DICKED": "The state of having been sexually penetrated by a penis. “Sorry to keep you waiting\n I got dicked real hard last night and I’m still a little sore this morning. Anyway\n who ordered the French toast and who had the Mickey Mouse pancakes?”", "DICKS": "Plural of dick\n slang for penis. Alternatively\n an unpleasant or rude person. “Wait\n Comcast just put their prices up again? Well they can eat a bag of dicks.”", "DICKY": "", "DIDDLE": "To masturbate or manually stimulate the vulva\n particularly when focusing on the clitoris. “My date canceled on me tonight so I’m just gonna stay home and diddle my skittle.”", "DILDO": "An object shaped like an erect penis used for sexual stimulation. Alternatively\n slang for a stupid or ridiculous person. “Wait\n you invited Chad to the party? Nooo\n that guy’s a total dildo!”", "DILDOS": "", "DILFS": "", "DILFY": "", "DINGER": "", "DINGLE": "", "DINGUS": "", "DINKED": "", "DINKIE": "", "DINKLE": "", "DINKS": "", "DINKUS": "", "DINKY": "", "DIRTY": "", "DOCKER": "", "DOCKS": "Third person singular verb for docking\n an intimate act in which the participants put the heads of their cocks together and one is enveloped within the foreskin of the other. Not to be confused with space docking\n which you absolutely should not look up. “When I first saw how perfectly my penis docks with yours\n that’s when I knew we were meant to be together.”", "DOGGER": "", "DOGGY": "A sexual position in which one partner typically bends over on their hands and knees while the other penetrates or otherwise stimulates them from behind. “This guy I hooked up with asked if I wanted to try doggy\n but when I said yes he pissed on my floor then scratched at the door to go out. I think I’ll be deleting that dating app.”", "DOINK": "", "DOINKS": "", "DOMINA": "", "DOMME": "Short for dominatrix\n a woman who plays a dominant role in a BDSM sexual relationship. “Ugh\n these quarterly sales reports have me so stressed out\n I need to take my mind off of work. I wonder if my domme is free to batter my ball sack with a couple of table tennis paddles this weekend?”", "DOMMED": "", "DOMMES": "", "DOMMY": "", "DONGLE": "", "DONGS": "", "DOODY": "", "DOOKIE": "", "DOUCHE": "", "DRAIN": "", "DRAWS": "", "DRILL": "", "DRILLS": "", "DROOL": "", "DUMMY": "", "DUMPER": "The absolute definitive and classiest method to refer to anyone’s ass. “Have you seen the dumper on my grandpa?”", "DUMPY": "", "EATING": "", "EATOUT": "", "ECCHI": "A sub-genre of Japanese anime and manga featuring erotic but not overtly pornography content. “I tried watching some ecchi but I guess I’ve watched too much hentai because I just can’t get hard unless graphic full penetration via demon tentacle is involved.”", "EDGED": "", "EDGES": "", "EDGING": "The act of delaying orgasm and intensifying sexual gratification by pausing stimulation moments before climax\n then resuming. \"You people might want to step back\n I\\'ve been edging for the past hour and a half and I\\'m about to go off like a fire hydrant.\"", "EEJIT": "", "EFFING": "", "ENEMA": "Involves inserting liquid into the rectum with the aim of emptying the bowels. Often used by medical professionals for helping with exams\n medications or treating medical conditions. Other times is used by cool people on a hot summer day to turn their ass into a sprinkler to entertain friends and family.", "ENEMAS": "", "EPEEN": "A person’s ego as defined by their online presence and persona. “He might have a big epeen but in IRL he ain’t shit.”", "ERECT": "The rigid\n engorged state of a penis\n clitoris\n or nipples\n typically caused by sexual excitement. e.g. \"Is it weird that the mere sight of Ewan McGregor as Obi-Wan Kenobi immediately makes my nipples erect?\"", "EROGE": "", "EROTIC": "", "ESCORT": "", "EXOTIC": "", "FACIAL": "A load of cum delivered onto someone’s face. “Oh yes\n I love a nice facial. And by facial I don’t mean a beauty treatment\n I mean a hot steaming load of cum all over my face because I’m such a filthy fucking slut.” - your mom\n yet again!", "FANDAN": "", "FANJO": "", "FANNY": "Chiely British slang term for vagina. Alternatively\n in the US\n slang for bottom\n often resulting in awkward misunderstandings for transatlantic visitors. “I want you to spank my fanny\n Nigel! Wait\n what the fuck are you doing?”", "FAPPED": "", "FAPPER": "", "FAPPY": "In the mood to masturbate. “Mom\n dad\n I’m feeling fappy so I’m going to my room and locking the door. I ask that you respect my privacy at this awesome time.”", "FARTED": "", "FARTER": "", "FARTS": "Plural of fart\n an emission of flatus from the anus\n or as a verb\n the act of emitting such gas. “Hee hee\n I did a stinky fart!”", "FARTY": "", "FECAL": "", "FECES": "", "FECKER": "", "FELATE": "", "FELCH": "The act of ejaculating inside someone’s asshole\n then slurping the cum out. “Don’t knock felching until you’ve tried it\n it’s the sexual equivalent of eating a lava cake. Except instead of molten chocolate it’s cum\n and instead of cake it’s an asshole.”", "FELTCH": "", "FEMBOY": "", "FEMDOM": "Short for female dominatrix/domination\n describing a woman who dominates a submissive partner in sexual role-play\n or the act of domination itself. “Sorry I’m late\n last night I went on a date with a woman who turned out to be a total femdom\n so I was up all night with a ball gag in my mouth getting my ass cheeks worked over with a meat tenderizer. Anyway\n let me show you both the house. It’s a charming mid-century modern that just came on the market\n perfect for a young couple looking to start a family…”", "FEMSUB": "", "FETISH": "", "FETUS": "", "FIDDLE": "", "FIGGED": "Past participle of figging\n the act of inserting a skinned piece of ginger root inside the human anus to achieve a burning sensation. “I’d rather be figged 1000 times than listen to Andrew Tate spout his misogynistic bullshit again.” ", "FILCH": "", "FILTH": "", "FILTHY": "", "FINDOM": "", "FINGER": "", "FINISH": "", "FISTED": "Past participle of fist\n the act of inserting one’s fingers\n or indeed entire hand\n into someone’s vagina or anus. “Sorry but I’m going to have to bail on that trip to the farmers market today\n Brian fisted me last night without any lube so I’m just going to spend the day on the couch with Netflix and an ice pack.”", "FISTER": "", "FISTS": "", "FLACID": "", "FLANGE": "", "FLAPS": "Slang term for labia\n the folds of skin surrounding the exterior of the vagina. “Trying to come up with a funny joke about the word flaps on a Friday afternoon when I could be doing real work makes me question the wisdom of inventing this stupid fucking game.” - Gary Whitta", "FLASH": "", "FLEDGE": "The act of ejaculating into the asshole of one’s sexual partner\n then slurping the cum out with a straw. Similar to felching. But with a straw. “Brittzey from twitch wanted a shout-out\n so we figured fledge would be a good word to do it with.”", "FLESHY": "", "FLICK": "", "FLIRT": "", "FLIRTS": "", "FLIRTY": "", "FLOGS": "", "FLOOZY": "", "FLUFF": "", "FLUID": "", "FONDLE": "", "FORGOT": "", "FORGY": "", "FORKED": "", "FORKER": "", "FORKS": "", "FREAK": "", "FREAKS": "", "FREAKY": "", "FRENCH": "", "FRICK": "A more socially acceptable substitute for “fuck”\n suitable for use at weddings\n funerals\n bat mitzvahs\n etc. “Frick! I forgot to save my game and now I have to do that whole fucking level over again.”", "FRICKS": "", "FRIGS": "", "FRISKY": "", "FROMBE": "An alternative name for doggy-style intercourse — literally a shortening of “from behind”. “My wife and I love frombe because we can both catch up on our Netflix shows while we’re fucking.”", "FROTH": "", "FROTHY": "", "FROTS": "Plural form of frot\n the act of rubbing or grinding two penises together for sexual pleasure. “My husband and I often enjoy a nice frot session\n but his cock is a lot bigger and better-looking than mine\n so it kind of looks like the penis version of Arnold Schwarzenegger and Danny DeVito in Twins.”", "FUCKED": "Past participle of “fuck”\n alternatively a more general term for something being in poor condition or an undesirable state of affairs. “I cannae give ye warp power just the now\n captain\n the engines are totally fucked!”", "FUCKER": "", "FUCKIN": "", "FUCKME": "", "FUCKO": "", "FUCKS": "Plural or active verb of fuck. “What I like about Lewdle is that sometimes the creators give zero fucks when writing the definitions and just phone it in.”", "FUCKY": "", "FUDGE": "", "FUGLY": "", "FUKBOI": "", "FUNBAG": "", "FUNKIT": "", "FUPAS": "", "FURPIE": "", "FURRY": "", "GAGGED": "Past participle of gag\n the pharyngeal reflex that may be triggered when deep-throating a penis during fellatio. “I’ve gagged on a few cocks in my time and I’m not ashamed to admit it.” - your mom\n again.", "GAINER": "", "GAPED": "Past participle of gape\n to stretch out an anus by means of sexual penetration. “Oh yeah\n that first date last night was fun. We saw a movie\n tried out that new Ethiopian restaurant. Then he took me back to his place and gaped me.”", "GAPES": "", "GAPING": "", "GARGLE": "", "GAYDAR": "", "GEEBAG": "", "GIGOLO": "", "GILFS": "Plural of GILF\n Grandmother I’d Like to Fuck. “I think I’ve been watching too much GILF porn\n I’ve taken up knitting and started eating liver and onions for dinner at five o’clock.”", "GILFY": "", "GIMPS": "", "GIRATE": "", "GIRTH": "The thickness of a penis. “My penis has more girth than it does length\n I refer to him as Colonel Otto Von Stubbington.”", "GIRTHY": "", "GIZZED": "", "GLANS": "The rounded part forming the end of the penis or clitoris. “In an all-penis remake of Die Hard the villain would be called Glans Gruber.”", "GLAZED": "", "GLIZZY": "", "GLORP": "A highly specific form of pornography in which naked genitalia are adorned with googly eyes for (we assume?) comedic and/or erotic effect. “Have you checked out r/glorp on reddit? On second thought\n don’t.”", "GLORY": "", "GLUCK": "Onomatopoeic descriptor for the sound made at the back of the throat while performing a particularly deep and energetic blowjob. “Oh yeah baby that’s right\n fuck my mouth harder *gluck* *gluck* *gluck*.”", "GLUCKS": "", "GOATSE": "Legendary photographic internet meme depicting an anonymous man using both hands to gape his asshole to a frankly astonishing degree. “I accidentally put a goatse pic in my sales presentation but I don’t think anyone noticed.”", "GOBBLE": "Slang for fellatio. “After a long hard day at work\n there’s nothing I enjoy more than to gobble on a long hard cock.” — your mom", "GOBBY": "", "GOLDEN": "", "GONAD": "Slang for testicle. “An interesting fact about Hitler is that he only had one gonad.”", "GONADS": "", "GONZO": "A sub-genre of pornographic film that dispenses with story lines and characterization and instead gets straight to the fucking. Often typified by low production values. e.g. \"That gonzo film I watched last night had such shaky camerawork I had a tough time busting a nut to it.\"", "GONZOS": "", "GOOBER": "", "GOOCH": "Alternative name for the perineum\n the area between the genitalia and the asshole. See also taint\n grundel. “Sorry I’m late everyone\n I accidentally nicked my gooch while I was shaving my balls in the shower. Anyway\n here’s my resume and references\n I think you’ll find I’m extremely well suited for this position.”", "GOOEY": "", "GOONED": "", "GOONER": "A person that is hopelessly addiction to pornography but is at peace with that fact and lets it rule and ruin their lives.", "GOONS": "", "GOOSE": "To pinch someone’s buttocks. “I tried to cheekily goose my wife at the party but accidentally got my mother-in-law instead. Now she’s sending me sexy texts. What do?”", "GOOSED": "", "GOOSER": "", "GREEK": "", "GRIND": "", "GRINDR": "", "GRINDS": "", "GROANS": "", "GROIN": "", "GROINS": "", "GROOL": "Girl drool\n a slang term for the fluid produced by the vagina when sexually aroused. “When my crush told me I looked cute today I admit a little grool came out.”", "GROPE": "", "GROPED": "", "GROPES": "", "GROSS": "", "GROWER": "A penis which may seem deceptively small while flaccid but which enlarges to an impressive size when erect. “I’m a grower\n not a shower.”", "GRUNT": "", "GRUNTS": "", "GSPOT": "", "GUMMER": "", "GUMMY": "A blowjob delivered by a toothless person. “I finally beat Doris at dominoes but she didn’t get her pension check yet so she offered to give me a gummy instead. Better go wash my cock.”", "GUNCH": "", "GUNTS": "", "GUSHED": "", "GUSHER": "Someone who projectile squirts during sex\n particularly during orgasm. “Oh God keep going\n I’m close. And fair warning\n I’m a gusher and about to go off like a fire extinguisher.”", "GUSHES": "", "GUSHY": "", "GUZZLE": "", "GYMRAT": "", "GYRATE": "", "HAIRY": "", "HANDLE": "", "HANDS": "", "HANDSY": "", "HANDY": "Slang for handjob. Which in turn is slang for manually stimulating a penis to ejaculation. e.g. \"I didn\\'t have enough cash to tip the pizza guy so I gave him a handy instead.\"", "HANKY": "", "HARDEN": "", "HARDON": "", "HAREM": "", "HAREMS": "", "HARLOT": "", "HASAN": "", "HELMET": "", "HENTAI": "Pornography in the form of anime and manga. “A friend of mine got me into hentai a few years ago\n now I’m deep down the rabbit hole and I can’t watch porn any more unless it has tentacles involved.”", "HERPES": "", "HEXES": "", "HICKEY": "A mark on the skin that occurs after having the skin sucked for an extended period of time. Often small but occasionally so large and perfectly circular that everyone in your class knows you just held the vacuum to your neck in an attempt to look like you made out with a babe.", "HICKY": " ", "HIMBO": "An attractive but unintelligent man. “My boyfriend is kind of a himbo\n he thought the Northern Ireland Protocol was a new Matt Damon movie.”", "HIMBOS": "", "HINEY": "Butt\n backside\n anus\n bottom. “Before we go any further\n I should let you know — if you put it in my hiney I’ll giggle and say “Oh\n fudge!” like a Keebler elf. It freaks some people out so I like to give a warning ahead of time.”", "HINEYS": "", "HOEBAG": "", "HOGTIE": "", "HOLED": "", "HOLES": "", "HONKER": "", "HOOCH": "", "HOOHA": "A vagina. “It’s been a while since my hooha’s seen any action\n maybe I should booty call my ex.”", "HOOKER": "", "HOOKUP": "The most casual of all sexual encounters. “Do you mind if I hookup with your mom?”", "HOOTER": "", "HORNY": "The state of being sexually excited\n keen to indulge in sexual shenanigans. “I’m so horny right now I could fuck a donut.”", "HOTBOX": "", "HOTCUM": "", "HUCOW": "", "HUMMER": "Often mistaken as a synonym for blowjob; a hummer is actually when the blow-er gently hums while giving oral sex to the blow-ee\n providing extra stimulation.", "HUMPED": "", "HUMPER": "", "HUMPS": "", "HUNGER": "", "HUNGRY": "", "HUNKY": "", "HUSSY": "Archaic derogatory term for a sexually brazen woman\n or one who has many casual sexual relationships. “I caught her texting nude pics to my husband\n I’m going to rip that dirty little hussy’s head off.”", "HUSTLE": "", "HYMEN": "", "HYMENS": "", "IMPACT": "", "INCEST": "The number one genre on PornHub\n shocking only those that haven’t previously used the internet.", "INNIE": "", "JAGOFF": "", "JELQED": "", "JELQS": "Any of a number of penis-stroking exercises that employ a specific method that when performed regularly are believed by some to stimulate blood flow and naturally increase the size of the penis over a period of weeks or months. \"I\\'ve been doing my jelqs every day for weeks now but there\\'s been no improvement\n I\\'m starting to think the internet isn\\'t the best place to get penis-enlargement advice.\"", "JERKED": "", "JERKER": "", "JERKIN": "", "JERKS": "", "JIGGLE": "", "JIGGY": "", "JISSOM": "", "JIZZED": "", "JIZZER": "", "JIZZY": "", "JOBBIE": "", "JOBBY": "Scottish slang for poop. “I was staggering back from the pub last night when I suddenly realized I had a massive jobby brewing. I was never going to make it home in time so I snuck into the alley behind the chip shop\n pulled down mah troosers and opened the bomb bay doors.”", "JONNY": "", "JUGGS": "", "JUICE": "", "JUICES": "", "JUICEY": "", "JUICY": "", "KANCHO": "A game popular in Japan in which participants join both hands together to make finger-guns and then attempt to sneak up on an unsuspecting victim and poke them in the ass while yelling “kancho!” (slang for enema). “Hmmmm\n Hideo looks pretty unsuspecting right now\n I’m going to sneak up and kancho him!”", "KAREN": "", "KEGEL": "", "KEGELS": "", "KINKED": "", "KINKER": "", "KINKS": "", "KINKY": "Involving or given to unconventional tastes in sex. “The guy I met on Tinder said he was kinky but when I went to his place he was dressed like Sonic the Hedgehog and whacking off into a box of Chicken in a Biskit. Even I have my limits\n so I just left.”", "KIPPER": "", "KITTY": "", "KNOBS": "", "KOOCH": "", "KURAC": "", "LABIA": "", "LABIAL": "", "LABIAS": "", "LANGER": "", "LASHES": "", "LATEX": "", "LAYER": "", "LEAKY": "", "LEASH": "", "LECHER": "", "LEGGY": "", "LENGTH": "Colloquial term for a penis\n particularly a large one. “In vain I have struggled. It will not do. My feelings will no longer be repressed. You must allow me to tell you how ardently I admire and love you. Oh how I yearn\n my dear sweet Elizabeth\n to slip you a length.” — Mr. Darcy\n Pride and Prejudice", "LEWDER": "", "LEWDLE": "", "LEWDS": "Soft-core erotic photographs that stop short of full nudity\n most commonly taken as selfies for private use such as sexting or controlled distribution via sites like OnlyFans\n etc. “I gave my phone to my grandma to show her the baby pictures but she swiped too far and totally saw some of my lewds. FML.”", "LIBIDO": "", "LICKED": "", "LICKER": "", "LICKS": "", "LICKY": "", "LIGMA": "One of many such words used to bait people into a hilarious joke involving mah balls or deez nuts. “Hey\n did you hear the news about ligma?” “No\n what’s ligma?” “Ligma balls lololololol.”", "LINUGS": "", "LIPSED": "", "LOADED": "", "LOADS": "Plural of load\n an ejaculation of semen. “The loads you seen in porn movies these days aren’t what they used to be. I’m old enough to remember Peter ‘The Shotgun’ North - the loads that guy used to drop could put out a forest fire.”", "LOINS": "", "LOOSE": "", "LOVER": "", "LUBED": "The state of being lubricated to allow for frictionless sexual contact. “”I’m all lubed up and ready to fuck!” said Snape as an arch grin spread across his pallid face. “Bend over Professor Dumbledore\n so I can slide my throbbing member between your wrinkled ass cheeks while you eat out Professor McGonagall’s soaking wet pussy.”” — excerpt from Adam’s tragically unpublished Harry Potter fan-fiction.", "LUBER": "", "LUBES": "", "LURID": "", "LUSTED": "", "LUSTER": "", "LUSTS": "", "LUSTY": "", "MACHT": "", "MAGNUM": "", "MANLET": "", "MARKED": "", "MARKER": "", "MASTER": "", "MATED": "", "MATES": "", "MATING": "", "MATURE": "", "MAUDE": "", "MEATY": "", "MELON": "", "MELONS": "", "MEMBER": "", "MENAGE": "Shortened form of menage a trios — from the French\n a threesome. “My wife asked if I was interested in a little menage with her and this guy she met at the gym. I thought menage was a type of soft cheese so I agreed and the next thing you know I’m getting fucked in the ass by a roided-out freak who’s also licking my wife’s taint. We’re doing it again next Tuesday.”", "MENSES": "", "MERKIN": "A hairpiece designed for the pubic region\n sometimes worn by actors in nude scenes\n but also considered fashionable in certain trendy hipster circles. “Goddammit\n I lost my merkin at Burning Man\n do you how long it took me to knit together all those pubes?”", "MILFS": "Plural of MILF\n aka ‘Mom I’d Like to Fuck’. “Bro\n your mom is a total MILF. What\n not cool?”", "MILFY": "", "MILKED": "", "MILKER": "A very large female breast\n suitable for suckling either for pleasure or nourishment. “Bro\n I can’t come over to your house to study any more\n your mom’s enormous milkers keep distracting me.”", "MILKIN": "", "MILKS": "", "MILKY": "", "MIMSY": "", "MINGE": "(Chiefly British) Vagina. “I’ve decided to name my minge\n and I’ve narrowed the list down to three contenders. Contessa Von Pussyflaps\n The Baroness\n and Miranda. Which one do you like best?”", "MINGES": "", "MINGIN": "", "MINGLE": "", "MOANED": "", "MOANER": "", "MOANIN": "", "MOANS": "", "MOFOS": "", "MOIST": "A word universally enjoyed by everyone\n describing the wettish\n sticky state of the genitalia caused by sexual arousal. “Watching Tottenham Hotspur batter Arsenal in the North London Derby made me positively moist with joy!” - Spurs fans Adele\n Tom Holland\n and Sir Kenneth Branagh\n probably.", "MOLEST": "", "MOMMY": "Common nomenclature for one who assumes a motherly persona during sex\n typically providing gentle maternal love\n care\n and affection to their partner as part of sexual role play. “Yes mommy\n I’ve been a very good boy today and I’d love to suck on your big ol’ titties.”", "MOOBS": "", "MOONED": "", "MOPED": "Derogatory term for an unattractive person who is good in bed. “Don’t tell anyone I’m dating Trevor\n he’s a total moped. Really fun to ride\n but I wouldn’t want any of my friends to see me on him.”", "MORON": "", "MORONS": "", "MOUND": "", "MOUNT": "", "MOUNTS": "", "MOUTH": "", "MOWED": "", "MPREG": "", "MUFFIN": "", "MUFFS": "", "MUNCH": "", "MUNGE": "", "MUNTER": "", "MUSKY": "", "NAILED": "", "NAILER": "", "NAILS": "", "NAKED": "", "NARDS": "Slang for testicles. e.g. \"Elden Ring is a really cool game but playing it is a bit like being kicked repeatedly in the nards.\"", "NASTY": "Particularly sexually depraved\n kinky\n lewd\n etc. “Hey\n remember Two Girls One Cup? That was some nasty shit.”", "NATES": "", "NAVEL": "", "NIMROD": "", "NIPPLE": "", "NOBBER": "", "NONCE": "", "NOODLE": "", "NOODS": "", "NOOKIE": "Harmless euphemism for sex. “Yeah nookie is great but have you tried canceling plans at the last minute?”", "NOOKY": "", "NOONER": "", "NORKS": "(Chiefly Australian) Breasts. “Strewth\n check out the norks on that Sheila!”", "NOTCH": "", "NUBILE": "", "NUDES": "", "NUDIE": "", "NUDIES": "", "NUDIST": "", "NUDITY": "", "NURSE": "", "NUTBAG": "", "NUTTED": "", "NYASH": "Booty\n particularly one of the thicc variety. “Damn bro\n your momma got hella nyash\n I’m gonna have to come over more often.”", "NYMPH": "", "NYMPHO": "", "OERVED": "", "OILED": "", "OPIUM": "", "OPPAI": "Colloquial Japanese term for breasts\n analogous to “titties” in English. “That new eroge game I found on Steam last night had some serious oppai action.”", "ORALLY": "", "ORGAN": "", "ORGANS": "", "ORGASM": "", "ORGIES": "", "ORGYS": "", "OTTER": "", "OUTIE": "", "OVARY": "", "PACKER": "", "PADDLE": "", "PAINAL": "", "PANTS": "", "PANTY": "", "PAWGS": "", "PAYPIG": "One who derives gratification by participating in a submissive relationship with a partner\n typically a BDSM mistress\n in which they consent to be financially dominated (known as findom). The sub provides the domme with money and gifts on demand\n sometimes handing over total control of their assets. “Playing Diablo Immortal is kind of like being a paypig except instead of a hot dominatrix all your money goes to Bobby Kotick.”", "PEACH": "", "PEAKED": "", "PECKER": "Slang for penis (chiefly U.S.) “I’d like to speak to the manager please\n there’s a glory hole in the men’s room but when I shoved my pecker in it nothing happened. What kind of establishment are you running here?”", "PEEING": "", "PEEPED": "", "PEEPEE": "", "PEGGED": "The state\n typically as a man\n of having been fucked in the ass by a person wearing a dildo. “My wife blindfolded me and said she was going to give me a sexy surprise for our anniversary\n and then she fucking pegged me with a strap-on the size of a can of Pringles. God I love that woman.”", "PEGGER": "", "PELVIS": "", "PENGUS": "A penis so short that it does not hang lower than the scrotum. “Yeah\n the break-up was pretty acrimonious\n I’m just hoping she’s not so pissed with me that she goes around telling everyone I have a pengus. Wait\n forget I said that.”", "PENILE": "", "PENIS": "", "PENISY": "", "PERIOD": "", "PERKY": "", "PERVY": "Sexually perverted. “Have you tried Lewdle? It’s like the pervy version of Taylordle.”", "PETER": "", "PETITE": "", "PETTED": "", "PETTER": "", "PHATTY": "", "PICKLE": "", "PIERS": "", "PIMPED": "", "PIMPER": "", "PIMPS": "", "PINCHE": "", "PINGA": "", "PISSED": "", "PISSER": "", "PISSIN": "", "PISSY": "", "PITHY": "", "PIZZLE": "", "PLATE": "", "PLAYED": "", "PLAYER": "", "PLEASE": "", "PLOINK": "", "PLOPS": "", "PLOUGH": "", "PLOWED": "", "PLOWER": "", "PLOWS": "", "PLUGS": "", "PLUMS": "Testicles. “Last night I had this dream where I was kicking Elon Musk repeatedly in the plums. I’ve never been so disappointed to wake up.”", "PLUNGE": "", "POKED": "", "POKES": "", "POKING": "", "POLES": "", "POLISH": "", "PONUT": "A term popular in the brony/clopper/furry communities to describe a cartoon pony’s anus. “Wait until you see the ponut I gave Twilight Sparkle in my latest fan art\n I think it’s really going to cause a stir.”", "PONUTS": "", "POODER": "", "POOING": "", "POONER": "", "POOPED": "", "POOPER": "", "POOPOO": "", "POOPS": "", "POOPY": "", "POOTER": "", "POPPER": "", "PORKED": "", "PORKER": "", "PORKS": "", "PORNO": "Short\n colloquial term for pornography. “After a hard day at work there’s nothing better than a glass of Chardonnay and a good porno\n preferably one involving lots of anal reaming and salad tossing.”", "PORNOS": "", "PORNS": "", "PORNY": "", "POTTY": "", "POUND": "", "POUNDS": "", "PRAISE": "", "PRECUM": "The clear fluid that oozes from the tip of a penis when sexually aroused. e.g. \"That episode of The Great British Bake-Off was so sexy a little precum trickled out while I was watching!\"", "PREGGO": "", "PRICK": "Slang for penis\n or a particularly contemptible person. “Mitch McConnell is a prick.”", "PRICKS": "", "PRIMAL": "", "PRIMED": "", "PRISS": "", "PROBE": "To insert a finger or object into an asshole for the purpose of sexual stimulation. “I was abducted by aliens who wanted to probe my ass. I told them the restraints would not be necessary.”", "PROBED": "", "PROBER": "", "PROBES": "", "PRUDE": "", "PUBES": "Slang for pubic hair. e.g. \"Excuse me waiter but I appear to have discovered some rather wiry pubes in my steak tartare. Would you care to explain?\"", "PUBIC": "", "PUCKER": "", "PUDDLE": "", "PUFFY": "", "PULLED": "", "PUMPUM": "", "PUNANI": "Slang for vagina\n popularized by citizen journalist Ali G. “I knew that dress was a bad choice for the ambassador’s reception! When I stepped out of the limousine everyone got an eyeful of my punani.”", "PUNISH": "", "PUSSY": "Common slang for vagina. “Yes! Yes! Fuck my tight wet pussy harder with that big fat cock!” — Your mom last night.", "PUTANG": "", "QUEAN": "", "QUEEF": "An audible release of air from the vagina\n typically during or after sex. “Last night I did a queef so loud it woke up the kids in the next room. I told them they were having a nightmare and to go back to sleep.”", "QUEEFS": "", "QUEEN": "", "QUEER": "", "QUICKY": "", "QUIMBY": "", "QUIMS": "Plural of quim\n largely archaic British term for vagina. “Why\n Lady Chessington! What a remarkably illustrious quim you have!” – someone in Bridgerton\n probably.", "QUIVER": "", "RABBIT": "", "RACIER": "", "RACKS": "", "RAILED": "", "RAILS": "", "RAKED": "", "RAKES": "", "RAMMED": "", "RAMROD": "", "RANDY": "The state of feeling sexually excited\n horny. “I was feeling so randy last night that I tried to fuck a pie like the guy in that movie. Unfortunately the only one I had was a frozen Sara Lee that was even harder than my cock. It didn’t end well but I give myself A for effort.”", "RAVAGE": "", "RAVISH": "", "RAWDOG": "Sexual intercourse without the use of a condom. “We were both feeling pretty horny last night but we were out of rubbers so we decided to rawdog it.”", "REAMED": "Past participle of ream\n the word given to a particularly punishing and sphincter-stretching form of anal penetration. “I totally reamed your mom last night.” - Me\n to you. ", "REAMS": "", "RECTAL": "", "RECTUM": "", "RIBBED": "", "RIDES": "", "RIDING": "", "RIGGER": "", "RIMBOW": "The act of stimulating the anus of one’s sexual partner by licking it in a semi-circular pattern\n mimicking the arc of a rainbow. “I’m going to bend over and pucker my asshole and I want you to paint a nice little rimbow back and forth on it with your tongue.” Your mom\n to me\n last night.", "RIMJOB": "The sexual act of orally pleasuring someone\\'s asshole. Also known as rimming.  e.g. \"Thanks Adam! That was the best rimjob I\\'ve had since the 80s!\"", "RIMMED": "", "RIMMER": "", "RIMMY": "", "RISKY": "", "RISQUE": "", "ROADIE": "", "ROGER": "", "ROOTED": "", "ROOTS": "", "ROPES": "", "ROUGH": "", "RUBBED": "", "RUBBER": "", "RUDIST": "", "RUMPS": "", "RYCOP": "", "RYCOPS": "", "SACKS": "", "SADISM": "", "SADIST": "", "SALIVA": "", "SANCHO": "", "SCORE": "", "SCORED": "", "SCREAM": "", "SCREW": "Informal term for having sex. \"Looks like the wi-fi\\'s gonna be down for a while\n wanna screw?\"", "SCREWS": "", "SCRODE": "", "SCROG": "Sex lacking in the traditional display of love\n tenderness and romance. Instead it is filthier\n more aggressive and usually includes screaming and name calling.", "SCROTE": "Short for scrotum\n often used as a pejorative term for a useless or unworthy person. “I lent Cliff fifty bucks for his dog’s hernia operation\n then it turns out he doesn’t even own a dog and he used it to buy an NFT of a monkey shaving its asshole\n that stupid fucking scrote.”", "SEDUCE": "", "SEGGS": "", "SEMEN": "The male reproductive fluid\n containing spermatozoa in a liquid suspension. “I should probably clean all these semen stains off the wall before my date comes over.”", "SENPAI": "", "SEXBOT": "", "SEXED": "", "SEXIER": "", "SEXILE": "To temporarily banish a roommate from shared habitation in order to have privacy for sexual relations. “Dude\n I’m going on a date tonight so if you come back to the dorm and there’s a sock hanging on the doorknob don’t come in — you’ve been sexiled.”", "SEXING": "", "SEXPOT": "", "SEXTED": "", "SEXTER": "", "SEXTOY": "", "SEXTS": "Explicit text or pictures messages send to another person. “This guy that is obsessed with me constantly sexts me pictures of naked Sonic the Hedgehog seductively pissing a powerful stream into the toilet”", "SEXUAL": "", "SHAFT": "The main body of the penis along its length\n particularly when erect. “Oh yeah\n that’s right baby\n run your tongue all the way up and down my shaft. Wow\n you really know what you’re doing\n don’t you?” – Me\n with your mom last night.", "SHAFTS": "", "SHAGS": "Plural of shag\n a British term for the act of fornication popularized worldwide by the Austin Powers films. “Do I make you horny baby? Would you like to shag me? Because I’ve got an absolutely massive thick veiny cock that I’d love to shove right up your sopping wet cunt. Oh behave!” — Austin Powers\n International Man of Mystery (1997).", "SHAMED": "", "SHAMER": "", "SHART": "To unintentionally defecate while farting - a shit-fart. “I sharted right before the big sales presentation\n fortunately it was over Zoom so no-one smelled anything.”", "SHARTS": "", "SHATS": "", "SHAVE": "", "SHAVED": "", "SHAWTY": "", "SHEET": "", "SHITE": "", "SHITES": "", "SHITS": "", "SHITTY": "", "SHLONG": "", "SHOOT": "", "SHOOTS": "", "SHOWER": "A penis that is already large when flaccid and does not increase much in overall size when erect. “I’m a shower\n not a grower.”", "SHREKD": "", "SHRIMP": "", "SHTUP": "To fornicate/fuck (Yiddish origin). “I know it’s probably a meshuga idea but I’m going to booty call my ex\n it’s been ages since I had a good shtup.”", "SIMBA": "The practice of ejaculating on one’s sexual partner\n then smearing some of the cum across their forehead with one\\'s thumb while dramatically exclaiming “Simbaaaaa!” like Rafiki in The Lion King. “Simbaaaaa!” ", "SIMPED": "", "SIMPER": "", "SIMPEY": "", "SIMPY": "", "SISSY": "", "SIXTY": "", "SKANK": "", "SKANKS": "", "SKANKY": "", "SKEET": "To ejaculate. “Man shit if you can say skeet on the radio/you know what\\'s so dope about skeet/white people don\\'t know what it means yet/when they figure it out they\\'re gonna be like ‘my god what have we done’\"  – Lil Jon & The East Side Boyz", "SKETEL": "", "SKIMPY": "", "SLAGS": "", "SLAPS": "", "SLASH": "", "SLAVE": "", "SLEAZY": "", "SLEEZY": "", "SLICK": "", "SLITS": "", "SLONG": "", "SLOOT": "", "SLOPPY": "", "SLORE": "", "SLUNT": "", "SLURP": "", "SLUTS": "", "SLUTTY": "", "SMACK": "", "SMANG": "A combination of “smash” and “bang” - to deliver a particularly vigorous and satisfying sexual performance. “I’ll leave your body feeling like a rainforest/So let’s get it poppin’ tell me can you hang?/Now lemme smang it\n baby/Smash it and bang” - Yung Humma", "SMASH": "", "SMEGMA": "The thick\n white substance comprised of fatty oil secretions and dead skin cells that collects under the foreskin of the penis or in the folds of the vulva. “I need to jump in the shower before we go out\n I haven’t had a chance to in a couple of days and there’s enough smegma down there to spread on a cracker.”", "SMELL": "", "SMELLY": "", "SMEXY": "", "SMOLE": "", "SMOLES": "", "SMUTTY": "", "SNATCH": "", "SNIFF": "", "SNIZZ": "", "SNOGS": "", "SNORT": "", "SNUFF": "", "SNUSNU": "Futurama Season 3 Episode 1 “Amazon Women in the Mood”", "SOAKS": "", "SOAPY": "", "SODOMY": "", "SOILED": "", "SOLES": "", "SORDID": "", "SOUND": "The act of sliding increasingly thick rods into the urinary meatus (the hole) of a penis to achieve pleasure.", "SOUPY": "", "SPAFF": "(Chiefly British) To ejaculate. “I just about spaffed my pants when Maverick did the canyon run in two minutes and fifteen seconds.”", "SPANK": "To slap someone\\'s buttocks with an open hand or flat object such as a paddle for the purpose of sexual gratification. e.g. \"Spank me harder\n professor\n I\\'ve been a very naughty girl!\"", "SPANKO": "", "SPANKS": "", "SPANKY": "", "SPERM": "", "SPERMS": "", "SPERMY": "", "SPICY": "", "SPITS": "", "SPLOSH": "The act of covering ones body in a variety of foods to increase pleasure during sexual acts. “I got a lifetime ban from Arby’s. Apparently\n they don’t like when you splosh yourself with a box of their mozzarella sticks in the lobby on a Tuesday morning.”", "SPOOGE": "", "SPOON": "", "SPOONS": "", "SPREAD": "", "SPRUNG": "", "SPUNK": "Slang for semen\n or as a verb\n the act of ejaculating such semen. “Have you ever tried tasting your own spunk? You know\n just to see what it’s like? No? Oh\n me neither.”", "SPUNKS": "", "SPUNKY": "", "SPURT": "To expel semen from the penis during orgasm. “I was watching my favorite Angela White videos last night and I spurted so hard it freaked out the cat. He still licked it up though\n the gross little fucker.”", "SPURTS": "", "SQUIRT": "When fluid is expelled from the vagina during orgasm. e.g. \"Jenny squirted in my face while I was going down on her last night and honestly I ain\\'t even mad.\"", "STAGS": "", "STAIN": "", "STAND": "", "STANK": "", "STICKY": "", "STIFF": "", "STIFFY": "An erect penis. “I had a stiffy all the way through that new Oscar Isaac movie. I’m only human\n after all.”", "STONK": "", "STRAP": "", "STRAPS": "", "STREAK": "", "STRIP": "", "STRIPS": "", "STROKE": "", "STUPID": "", "SUBMIT": "", "SUCKED": "", "SUCKER": "", "SUCKLE": "The act of wrapping your lips around anything and sucking lightly and continuously. ", "SUCKS": "", "SUCKY": "", "SUGMA": "Sugmadick. Gottem!", "SULTRY": "", "SWAMPY": "", "SWATS": "", "SWEAT": "", "SWELL": "", "SWELLS": "", "SWING": "", "SWINGS": "", "SWITCH": "", "SWIVE": "", "SYBIAN": "Brand name of a range of large industrial-grade vibrators manufactured by Abco Research Associates. Designed to be straddled and operated via a handheld dial pad. Capable of bringing about bone-shaking orgasms. e.g. \"I took my first Sybian ride last night and have since concluded that men have no reason to exist.\"", "TACOS": "", "TAGNUT": "Dried pieces of fecal matter adhering to the hairs around the asshole. Also known as klingons\n dangleberries\n coco pops\n bum crumbs\n winnits. “The As Seen On TV people rejected my patented tagnut remover\n I swear those people don’t know a million-dollar idea when they see one.”", "TAINT": "The liminal space that exists between the genitalia and the asshole\n so-called because it ain’t one thing or the other. “Dammit I’ve got an itchy taint\n I wonder if I can scratch it without anyone on this Zoom call noticing. Oh sorry\n did I say that out loud?”", "TAINTS": "", "TAMPON": "", "TARTS": "", "TATAS": "", "TATTA": "", "TAWDRY": "", "TEABAG": "To lower one’s testicles into someone’s mouth\n or drape the scrotum over their face\n commonly in the form of an immature prank. Also widely known in the Halo online community as the act of repeatedly crouching over a vanquished opponent to simulate said prank. “If that motherfucker teabags me one more time I swear I’m going to rage-quit.” ", "TEASE": "", "TEASED": "", "TEASES": "", "TEATS": "", "TEMPO": "", "TENTED": "When someone with a penis becomes aroused and the penis makes their bottoms (pants\n skirt\n etc) bulge outwards resembling a tent. Often occurring at the worst possible time resulting in vicious mockery.", "TESTE": "", "TESTES": "", "THICC": "Sexily curvaceous. “Dude\n your mom is thicc! What? Still not cool?”", "THICK": "", "THIGH": "", "THIGHS": "", "THINGY": "", "THIRST": "", "THONG": "", "THONGS": "", "THOTS": "", "THOTTY": "", "THROAT": "", "THROB": "A pulsating\n swelling sensation in the genitalia caused by increased blood flow when sexually aroused. “I’m so excited for Issue #1 of Batman - Fortress\n written by Lewdle co-creator Gary Whitta and in all good comics stores May 24 that my dick is positively throbbing with anticipation.”", "THROBS": "", "THRUST": "", "THURP": "", "TIDDIE": "", "TIDDY": "", "TIGHT": "", "TINDER": "", "TINKLE": "", "TITJOB": "The act of manually stimulating a penis by enveloping it between a pair of breasts. “I was a bit bored last night so I tried to give myself a titjob using a couple of burger buns. I couldn’t really get anything going but it seemed a shame to waste the buns so I put them back in the bread bin. I’m sure my roommates won’t notice.”", "TITTY": "A breast. “Niko\n it’s your cousin Roman! Let’s go to the strip club! Titties titties titties!” Roman Bellic\n Grand Theft Auto IV\n 2008", "TITTYS": "", "TODGER": "Penis (chiefly British). “I invested my life savings in cryptocurrency\n which turned out to be the financial equivalent of setting fire to my todger.”", "TOEJOB": "To stimulate or tease a penis using one’s toes and/or toenails. “My boyfriend’s got a major foot fetish so for his birthday I gave him a nice toejob.”", "TOILET": "", "TONGUE": "", "TONIC": "", "TOOBIN": "The act of masturbating while on a Zoom call. Inspired by attorney and CNN legal analyst Jeffrey Toobin\n who gained notoriety by getting busted doing it. “I noticed Chad didn’t really seem all that engaged on the sales call\n I think he might have been toobin.”", "TOOTS": "", "TOPPED": "", "TOPPY": "", "TOSSER": "(Chiefly British) Another form of “wanker”\n derived from tossing off\n or masturbating. Used less in a sexual context and more as a form of derision or abuse. “Did you see that interview with Donald Trump and Piers Morgan the other night? Hard to know which one is the biggest tosser.”", "TOUCH": "", "TOUCHY": "", "TOYBOY": "", "TOYED": "", "TRAIN": "", "TRAINS": "", "TRAMP": "", "TRAMPS": "", "TRAPS": "", "TRASHY": "", "TRIBS": "Third person singular verb for tribadism\n aka tribbing\n a sexual act in which two participants stimulate each other’s vulvas by rubbing and/or grinding them together. “My new girlfriend and I don’t have too much in common but she tribs like a goddamn porn star so I’m not going anywhere.”", "TRICH": "", "TRICK": "", "TRUMP": "(Chiefly British) A fart\n or the act of farting. “You’d better open a window\n I had a particularly spicy prawn vindaloo last night and I can feel a real five-alarm trump coming on.”", "TRUMPS": "", "TUCKED": "", "TUGGED": "", "TUGGER": "", "TUGGIE": "", "TUGGY": "", "TUGJOB": "", "TULIP": "", "TUMMY": "", "TURDS": "", "TURGID": "", "TUSHIE": "", "TUSHY": "", "TWATS": "Plural of twat\n slang for vagina. Alternatively\n a contemptible or stupid person. “I tried watching Top Gear but the hosts were a bunch of twats.”", "TWERK": "A sexually provocative dance centered around the energetic shaking of one’s booty. “I just found my grandma twerking on TikTok\n if you need me I’ll be in the laundry room pouring bleach into my eyes.”", "TWERKS": "", "TWINK": "A young\n boyishly-attractive gay man. “Tom Holland is my fantasy twink. Never mind about Spidey-sense\n he gets my cock tingling.”", "TWINKS": "", "TWINS": "", "TWUNK": "", "TWUNT": "", "TWUNTS": "", "UNCUT": "", "UNDERS": "", "UNDIES": "", "UNDONE": "", "URINE": "", "UTERUS": "", "VADGE": "", "VAGINA": "", "VAGOO": "", "VAGUNT": "", "VAJAY": "", "VAPING": "", "VEDGIE": "", "VEINY": "", "VIAGRA": "", "VIBES": "", "VINYL": "", "VIRGIN": "", "VIXEN": "", "VIXENS": "", "VOMIT": "", "VORED": "", "VOYEUR": "", "VULVA": "", "VULVAS": "", "WAIFU": "", "WAIFUS": "", "WANGER": "", "WANGS": "", "WANKED": "", "WANKER": "Technically\n one who masturbates. But more commonly used\n chiefly in the UK\n Australia and New Zealand\n to describe an excessively unpleasant or pretentious person; an asshole. “Oh fuck me\n it’s that wanker Piers Morgan again. Quick\n change the channel!”", "WANKS": "Plural or active verb of wank\n to masturbate. “I’ve lost count of how many lunchtime wanks I’ve had since I started working from home.”", "WANKY": "", "WASTED": "", "WAXED": "", "WEEING": "", "WEENIE": "", "WEINER": "", "WEIRDO": "", "WELTS": "", "WENCH": "", "WENIS": "", "WETTER": "", "WHINE": "", "WHIPS": "", "WHORE": "", "WHORED": "", "WHORES": "", "WIENER": "", "WILLY": "Harmless slang for a penis\n particularly when in a flaccid state. “I might not have a big willy\n but it’s not the size that matters\n but what you do with it. Unfortunately I have no idea what to do with it either.”", "WINKY": "", "WOBBLE": "", "WOODY": "", "WRISTY": "", "WUSSY": "", "YANKED": "", "YANKER": "", "YANKS": "", "YANKY": "", "YEARN": "", "YEAST": "", "YENTZ": "", "YIFFED": "", "YIFFER": "", "YIFFS": "", "YIFFY": "Sexy\n or aroused\n in the sub-culture of those who find anthropomorphic animals sexually appealing. “Which one do you think is more yiffy\n Applejack or Rainbow Dash?”", "YONIC": "Relating to or shaped like the external female genitalia\n from “yoni”\n a symbol of worship associated with the Hindu goddess Shakti. “Have you seen that new Al Wakrah stadium they built for the World Cup in Qatar? It’s a bit\n um… yonic.”", "YONIS": "", "YUMMY": "", "ZADDY": "A handsome\n sexy\n fashionable\n typically older man. Think Harrison Ford\n Idris Elba\n that guy who used to play the most interesting man in the world in the Dos Equis commercials. “I don’t care what anyone says\n Bobcat Goldthwait is a total zaddy. This is a hill I’m willing to die on.”", "ZAFTIG": "", "ZENTAI": "", "STEAMY": "", "REAMER": "", "TEASER": "", "GAPER": "", "MANKY": "", "GLAND": "", "UGLYS": "", "ERUPT": "", "COCKY": "", "PINCH": "", "LAVDA": "", "CARESS": "", "BALLER": "", "THUSSY": "", "SWASS": "", "SWOOB": "", "HONKA": "", "BLORF": "", "CLUSSY": "Clown Pussy. That’s it. Now try to go about your day pretending you didn’t learn this.", "ASSBAG": "", "BUNGS": "", "PUBIS": "", "MINGEY": "", "COCKED": "", "CLOTH": "", "JOHNS": "", "DEUCE": "", "SPOCK": "", "NUTTIN": "", "DONGER": "", "MASHED": "", "PANTSU": "", "BUMOLE": "", "CANED": "", "FARKED": "", "FRACK": "", "DOCKED": "", "ARMPIT": "", "LEGPIT": "", "HARDER": "", "MADAM": "", "BUKAKI": "", "CUMET": "The name for an extremely speedy globule of semen flying through the air from an intense ejaculation.", "JAMBOY": "", "TRADE": "", "DRIPPY": "", "PRONE": "", "URANUS": "", "PIDDLE": "", "WIDDLE": "", "BLUMPY": "The act of giving a blowjob while the person receiving the blowjob is taking a shit. Yup. That’s real. That’s a real thing people have done\n I guess. This fucking game. It’s ruined me. ", "BATTER": "", "ANEROS": "", "STUFF": "", "GROWL": "", "FUTAS": ""}
